# Importing required libraries.

In [469]:
import pandas as pd
import numpy as np

# Creating the header for the required datasets

In [470]:
#column headers for the dataset
#assign the variable names or column names to each data.
data_cols = ['user id','movie id','rating','timestamp']
item_cols = ['movie id','movie title','release date','video release date','IMDb URL','unknown','Action','Adventure','Animation',
             'Childrens','Comedy','Crime','Documentary','Drama','Fantasy','Film-Noir','Horror','Musical','Mystery','Romance ',
             'Sci-Fi','Thriller','War' ,'Western']
user_cols = ['user id','age','gender','occupation','zip code']

# Import the data files using Pandas

In [471]:
#load the data files using pandas read_csv() function.
#importing the data files onto dataframes

data = pd.read_csv('ml-100k/u.data', sep='\t',names=data_cols, encoding='latin-1')

item = pd.read_csv('ml-100k/u.item', sep='|',names=item_cols, encoding='latin-1')

users = pd.read_csv('ml-100k/u.user', sep='|',names=user_cols, encoding='latin-1')

In [472]:
data.head()

   user id  movie id  rating  timestamp
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116
3      244        51       2  880606923
4      166       346       1  886397596

In [473]:
item.head()

,movie id,movie title,release date,video release date,IMDb URL,unknown,Action,Adventure,Animation,Childrens,...,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,0,0,0
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [474]:
users.head()

   user id  age gender  occupation zip code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

# 1.	How many of the users are artists?

In [475]:
#Count of 1.How many of the users are artists? 

occupation_group = users.groupby('occupation').size()
print("Number of Users who are artists are = ", occupation_group['artist'])

Number of Users who are artists are =  28

# How many of the users are artists at least 25 years old?

In [476]:
artist_group = users.loc[users['occupation'] == "artist"]
# (users['occupation']=='artist').value_counts()
artist_group.head()

    user id  age gender occupation zip code
22       23   30      F     artist    48197
23       24   21      F     artist    94533
30       31   24      M     artist    10003
95       96   25      F     artist    75206
96       97   43      M     artist    98006

In [477]:
#How many of the users are artists at least 25 years old?

age_filter = artist_group.loc[artist_group['age'] >= 25]
print("Number of Users who are artists and at least 25 years old = ", age_filter['age'].count())

Number of Users who are artists and at least 25 years old =  22

In [478]:
# Create a merged data-frame of all the datasets based on a similar column.

df_merge = pd.merge(pd.merge(item, data), users)     #item & data has common attribute "movie id" and then the (item,data) & users having common column "user id"

In [479]:
# Group by Movies by their title
ratings_total = df.groupby('movie title').size()
print(ratings_total.head())

movie title
'Til There Was You (1997)      9
1-900 (1994)                   5
101 Dalmatians (1996)        109
12 Angry Men (1957)          125
187 (1997)                    41
dtype: int64

# 2.	Movies are rated on a 1-5 scale. What is the average movie rating?

In [480]:
# Take the mean ratings of each movie using the mean function
#Average Movie Ratings

ratings_mean = (df_merge.groupby('movie title'))['movie title', 'rating'].mean()
print("Avearge Movie rating of each movies are as follows:\n")
print(ratings_mean.head())

Avearge Movie rating of each movies are as follows:

                             rating
movie title
'Til There Was You (1997)  2.333333
1-900 (1994)               2.600000
101 Dalmatians (1996)      2.908257
12 Angry Men (1957)        4.344000
187 (1997)                 3.024390

In [481]:
# Modify the dataframes so that we can merge the two
# Now we sort the values by the total rating

ratings_mean['movie title'] = ratings_mean.index

# What is the average rating given for movie id #1? For movie id #2? What are those movies?

In [482]:
#finding the movie title corresponding to the "movie id = 1".

movie_id1 = item.loc[item['movie id'] == 1]
print("Title of Movie whose movie id is 1 :" ,movie_id1.iloc[0]['movie title'])

Title of Movie whose movie id is 1 : Toy Story (1995)

In [483]:
# As we already know the title of "movie id = 1" in above step. So with the help of rating_mean we can find the average rating corresponding to movie title.

movie_id1_rating = rating_mean.loc[ratings_mean['movie title'] == 'Toy Story (1995)']
print("Average rating for movie id 1 is: ",movie_id1_rating.iloc[0]['rating'])

Average rating for movie id 1 is:  3.87831858407

In [484]:
#finding the movie title corresponding to the "movie id = 2".

movie_id2 = item.loc[item['movie id'] == 2]
print("Title of Movie whose movie id is 2 :" ,movie_id2.iloc[0]['movie title'])

Title of Movie whose movie id is 2 : GoldenEye (1995)

In [485]:
# As we already know the title of "movie id = 2" in above step. So with the help of rating_mean we can find the average rating corresponding to movie title.

movie_id2_rating = rating_mean.loc[ratings_mean['movie title'] == 'GoldenEye (1995)']
print("Average rating for movie id 2 is: ",movie_id2_rating.iloc[0]['rating'])

Average rating for movie id 2 is:  3.20610687023

# 3.	What is the gender and zip code of the user who rated the most movies?

In [486]:
data.sort_values(['rating'], ascending=False).head()

       user id  movie id  rating  timestamp
28336       64       183       5  889737914
16000      213       121       5  878870940
28426      286       707       5  877531975
38655       94       518       5  891720950
16022      108        10       5  879879834

In [487]:
user_data = data.groupby('user id').size()

In [488]:
#Now if you check user_data then you will find it is as a Series and not a Data Frame. 
#So, we need to convert it into data-frame.
#convert series into Data frame
movie_rating_user = pd.DataFrame({'user id':user_data.index, 'rating':user_data.values})

#sorting on the basis of users rating
most_rated = movie_rating_user.sort_values(by ='rating', ascending=False)
most_rated.head()

     rating  user id
404     737      405
654     685      655
12      636       13
449     540      450
275     518      276

In [489]:
#finding is the gender and zip code of the user who rated the most movies?

print("The User who rated most movies has user id  = ",most_rated.iloc[0]['user id'])

The User who rated most movies has user id  =  405

In [490]:
users.head()

   user id  age gender  occupation zip code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [491]:
final_user_most_rated = users.loc[users['user id'] == 405]
fianl_user_most_rated

     user id  age gender  occupation zip code
404      405   22      F  healthcare    10019

In [492]:
#finding the gender and zip code of the user who rated the most movies

print("Gender of the most movie rated user = ", final_user_most_rated.iloc[0]['gender'])
print("Zip Code of the most movie rated user = ", final_user_most_rated.iloc[0]['zip code'])

Gender of the most movie rated user =  F
Zip Code of the most movie rated user =  10019

# Summary of all answers

In [493]:
# 1. Number of Users who are artists are =  28

# Number of Users who are artists and at least 25 years old =  22


# 2. Average rating for movie id 1 is:  3.87831858407
# Title of Movie whose movie id is 1 : Toy Story (1995)

# Average rating for movie id 2 is:  3.20610687023
# Title of Movie whose movie id is 2 : GoldenEye (1995)


# 3. Gender of the most movie rated user =  F
#    Zip Code of the most movie rated user =  10019

# 4. Open Ended Question:- Assume that you are hired by a major Hollywood movie studio. Figure out an interesting use of the movielens dataset. What interesting stories using the data in movielens dataset you would like to tell a studio executive?

In [494]:
# Uses of Movielens Dataset are as follows:

# 1. We can find out the most rated movies
# 2. Movies which is most highly rated
# 3. We can also predict which movies are most controversial amongst different ages
# 4. We can also predict which movies do men and women most disagree on
# 5. We can also use this movielens dataset for finding out which occupation people are most rated the movies
# 6. We can make the Movie Recommender System
# 7. Using the Movielens datset we are able to find out the average, max, min, etc ratings of the movie
# 8. Movielens dataset help in fiding the movie suitable for which age group
# 9. We can also use MOvielens dataset for findind which movie is best recommended for which user

In [468]:
print("Uses of Movielens Dataset are as follows: \n")

print("1. We can find out the most rated movies\n2. Movies which is most highly rated\n3. We can also predict which movies are most controversial amongst different ages\n4. We can also predict which movies do men and women most disagree on\n5. We can also use this movielens dataset for finding out which occupation people are most rated the movies\n6. We can make the Movie Recommender System\n7. Using the Movielens datset we are able to find out the average, max, min, etc ratings of the movie\n8. Movielens dataset help in fiding the movie suitable for which age group\n9. We can also use Movielens dataset for findind which movie is best recommended for which user")

Uses of Movielens Dataset are as follows:

1. We can find out the most rated movies
2. Movies which is most highly rated
3. We can also predict which movies are most controversial amongst different ages
4. We can also predict which movies do men and women most disagree on
5. We can also use this movielens dataset for finding out which occupation people are most rated the movies
6. We can make the Movie Recommender System
7. Using the Movielens datset we are able to find out the average, max, min, etc ratings of the movie
8. Movielens dataset help in fiding the movie suitable for which age group
9. We can also use Movielens dataset for findind which movie is best recommended for which user